"""
Bot messages
"""

# ---------HELP---------
BOT_COMMANDS_INFO = (
    ("start",
     "Начало работы с ботом",
     "При отправке этой команды происходит начало взаимодействие с ботом"
     ),
    ("help",
     "Помощь и справка",
     "При отправке этой команды бот покажет, какие команды доступны для взаимодействия с ним",
     ),
)

TEXT_HELP = "Помощь и справка о боте\n\n" \
            "Для того, чтобы отписаться, отправь сообщение 'Отписаться' в чат\n\n" \
            "Доступные команды:\n" \
            "- /start\n" \
            "- /help\n"

# ---------MIDDLEWARES---------
PERMISSION_DENIED_MESSAGE = "У вас нет прав для доступа к этому боту :("

# ---------START---------
GREETING_TEXT = "Привет, это Ozon parser bot"
